artillery/cart/add-to-cart.yml
config:
  target: https://www.saucedemo.com/
  engines:
    playwright:
      launchOptions:
        headless: false
      testIdAttribute: data-test
  processor: "add-to-cart.runner.ts"
  phases:
  - name: 2usersPerSecondFor5Seconds
    duration: 5
    arrivalRate: 2
scenarios:
- name: "Add to cart load test"
  engine: "playwright"
  testFunction: "addToCartTest"